import java.awt.*;
import java.applet.*;

public class AppletSkel extends Applet {
	// Выполняется первым
	public void init() {
		// Инициализаия
	}

	// Выполняется вторым, после init(). Вызывается при перезапуске аплета
	public void start() {
		// запускает и возобновляет выполнение
	}

	// Вызывается при остановке аплета
	public void stop() {
		// приостановка выполнения
	}

	// Вызывается перед уничтожением аплета. Последний выполняемый метод
	public void destroy() {
		// выполняет завершающие действия
	}

	// вызывается, когда окно аплета должно быть восстановлено
	public void paint(Graphics g) {
		// перерисовка содержимого окна
	}
}
