package org.proton;

/**
 * Запуск и останов
 * Система выполняет периодическую загрузку файлов из одного каталога (источник, с поддиректориями)
 * в другой каталог (приёмник, без поддиректорий).
 * Предварительно проверяется число файлов в каталоге приёмника.
 * Если число меньше заданной величены - производится перенос n-го числа файлов из истоичника в приёмник
 */
public class start {
    /**
     * Точка отчёта
     * Загружает параметры, определяет дальнейшую работу
     *
     * @param args Аргументы командной строки, игнорируются.
     *             Используется файл свойств (.properties)
     */
    public static void main(String args[]) {
        // Считываем настройки и запускаем процесс
        rocket process = new rocket(settings.readSettings());
        process.execute();
    }

}

